tap "1password/tap"
tap "robinovitch61/tap"

brew "atuin"
brew "openssl@3"
brew "certigo"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "duti"
brew "fd"
brew "fzf"
brew "git"
brew "git-delete-merged-branches"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubie"
brew "libyaml"
brew "mas"
brew "mise"
brew "mongosh"
brew "mysql-client@8.0", link: true
brew "neovim"
brew "ripgrep"
brew "semgrep"
brew "shared-mime-info"
brew "sheldon"
brew "shellcheck"
brew "sipcalc"
brew "starship"
brew "tig"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "robinovitch61/tap/kl"

cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "choosy"
cask "cursor"
cask "firefox"
cask "font-comic-mono"
cask "font-liga-comic-mono"
cask "font-monaspace"
cask "ghostty"
cask "orbstack"
cask "raycast"
cask "sublime-text"
cask "visual-studio-code"
cask "wezterm"

mas "Anybox", id: 1593408455
# mas "Craft", id: 1487937127
# mas "Divvy", id: 413857545
# mas "Flighty", id: 1358823008
mas "Numbers", id: 409203825
mas "Peek", id: 1554235898
mas "Quiver", id: 866773894
mas "Xcode", id: 497799835

vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "ms-vscode-remote.remote-containers"
vscode "shopify.ruby-lsp"
vscode "trongthanh.theme-boxythemekit"
vscode "waderyan.gitblame"
