tap "filippo.io/age", "https://filippo.io/age"
tap "gobuffalo/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "phinze/cask"
tap "square/formula", "https://git.sqcorp.co/scm/sq/homebrew-formulas.git"
tap "square/self"
# Simple, modern, secure file encryption
brew "age"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cross-platform make
brew "cmake"
# LibCrack password checking library
brew "cracklib"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# NaCl networking and cryptography library
brew "libsodium"
# Utility to list open files
brew "lsof"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Open source suite of directory software
brew "openldap"
# Ruby version manager
brew "rbenv"
# Integrate rbenv and bundler
brew "rbenv-bundle-exec"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# Compression/decompression library aiming for high speed
brew "snappy"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# YubiKey personalization library and tool
brew "ykpers"
# Drop-in MySQL replacement
brew "square/formula/percona-server"
brew "square/self/erg"
cask "chromedriver"
cask "iterm2"
cask "keepingyouawake"
cask "meld"
cask "parallels"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "signal"
cask "spotify"
cask "suspicious-package"
cask "whatsapp"
