tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "asdf"
brew "bat"
brew "exa"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tig"

cask "1password"
cask "1password-cli"
cask "iterm2"
cask "keepingyouawake"
cask "sublime-text"

## These are do-without-able
# cask "brave-browser"
# cask "cleanmymac"
# cask "discord"
# cask "slack"
